/*
 * =====================================================================================
 *
 *       Filename:  AC.c
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  06/22/2017 05:33:21 PM
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  xiangwei.tian (), tianxiangwei@gmail.com
 *   Organization:  
 *
 * =====================================================================================
 */

/*
 * 对于给定长度为N的文本和模式集合P{p1,p2..pm}
 * 时间复杂度 O(N) 即复杂度只与给定的文本长度n有关，而与模式集合的规模m无关
 *
 * */
