/*
 * =====================================================================================
 *
 *       Filename:  naive_bayes.c
 *
 *    Description:  naive bayes classifier
 *
 *        Version:  1.0
 *        Created:  02/21/2017 08:19:30 PM
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  xiangwei.tian (), tianxiangwei@gmail.com
 *   Organization:  
 *
 * =====================================================================================
 */

//朴素贝叶斯分类器，常用的分类算法
//假设某个体有n项特征(Feature)，分别为F1,F2,...,Fn。现在有m个类别(Category)，分别为C1,C2,...，Cm.
//贝叶斯分类器就是计算出概率最大的那个分类，计算某个分类的概率的公式如下:
//P(C|F1F2...Fn)=P(F1F2...Fn|C)P(C)/P(F1F2...Fn)
//由于P(F1F2...Fn)对于所有类别都是相同的，可以忽略，问题就变成了求P(F1F2...Fn|C)P(C)的最大值
//朴素贝叶斯分类器更进一步，假设所有特征都彼此独立,因此
//P(F1F2...Fn|C)P(C)=P(F1|C)P(F2|C)...P(Fn|C)P(C),等号右边的每一项都可以从统计资料中得到，因此就可以计算出每个类别对应的概率
//从而找出最大概率的那个类。
